#+STARTUP: indent
#+TITLE: org-mode学习笔记
* 章节
** 这是一个二级标题
*** 有几个*就是几级标题
* 脚注
  使用 ~[fn:1]~ 的方式插入脚注，在最下边插入
  ~[fn:1]本文参考自http://orgmode.org/orgguide.pdf~
  [fn:1]
  [fn:1]本文参考自http://orgmode.org/orgguide.pdf
  这个标签是有效的，可以点击。
* 列表
  列表可以加入选项框，在标题后加上中间有空格的方括号 ~[ ]~ ，
可以用来标识任务完成状态， 中括号中间加上一个大写X标识着任务以完成~[X]~
** 无序列表
   无序列表以+/-开头，同样后边要跟一个空格。
   
   + 这是一个无序列表
     + branch1
     + branch2

** 有序列表
   有序列表以1./1)开头，一样要加空格。

   1. 作业[33%]
      1. [ ] 高等数学
      2. [-] 大学物理[1/2]
         1. [ ] 理论
         2. [X] 实验
      3. [X] 电路分析  
   2. 活动 [1/2]
      1. [X] 冒险岛
      2. [ ] 魔兽世界
* 表格
  org-mode支持类似excel的表格函数，可以完成简单的求和等操作。
创建表格时，首先输入表头：

#+BEGIN_SRC
| 姓名 | 平时分 | 考试分 | 总分 | 
|-
#+END_SRC

在 ~|-~ 后按Tab就可得到如下： 

| 姓名 | 平时分 | 考试分 | 总分 |
|------+--------+--------+------|
|      |        |        |      |
然后我们填入数据：
| 姓名 | 平时分 | 考试分 | 总分 |
|------+--------+--------+------|
| 张三 |     88 |     45 |      |
| 李四 |     95 |     27 |      |
| 何二 |     85 |     55 |      |

填入数据时按Tab可以调到右方表格，按Enter是下方，S+Tab/Enter是反向。
当然上下左右也是可以移动光标位置，但是不会新建表格行。
输入完成后 ~C-c C-c~ 可自动对齐。
可以在总分那一栏任意一格输入 ~=$2*0.5+$3*0.5~ 按 ~C-u C-c C-c~ 便能所有计算总分 。
若要计算某一格直接键入 ~C-c C-c~ 就行。

| 姓名 | 平时分 | 考试分 | 总分 |
|------+--------+--------+------|
| 何二 |     85 |     55 |  70  |
| 张三 |     88 |     45 | 66.5 |
| 李四 |     95 |     27 |  61  |
#+TBLFM: $4=$2*0.5+$3*0.5
  如果要插入显得行或者列
* 富文本
** 特殊文本
   org-mode有一些特殊的文本格式：
   + *粗体*
   + /斜体/
   + _下划线_
   + =代码=
   + ~代码~
   +删除线+
** 时间
 + ~C-u M+! date~
   + Tue Aug  1 20:00:49 CST 2017 
 + ~C-c .~
   + <2017-08-01 Tue>
** 代码块
   org-mode可以直接求出源代码的运行结果，但是需要配置：
#+BEGIN_SRC
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (sh . t)
   (python . t)
   (R . t)
   (ruby . t)
   (ditaa . t)
   (dot . t)
   (octave . t)
   (sqlite . t)
   (perl . t)
   (C . t)
   ))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(+ 1 2 3 4)
#+END_SRC

#+RESULTS:
: 10

#+BEGIN_SRC python :results output
  print('A'*5)
  import pwn
  print(pwn.shellcraft.sh())
#+END_SRC

#+RESULTS:

#+begin_src C :includes <stdio.h>
  int a=1;
  int b=1;
  printf("%d\n", a+b);
#+end_src

#+RESULTS:
: 2

